"""
Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
"""
n=input("Введите число:")
a=int(n[0])
b=int(n[1])
c=int(n[2])
print(a+b+c)